<template>
	<view style="padding:30rpx;background: #fff;">
		<view class="title">科维特小程序服务条款</view>
		<view class="title-label">
			重要提示：
		</view>
		<view class="title-content">
			深圳市克拉星球科技有限公司科维特小程序（以下统称：科维特）依据本服务协议（以下统称：本条款）为用户提供科维特服务，
			本条款在用户和深圳市克拉星球科技有限公司之间均具有合同上的法律效力。科维特在此特别提醒用户认真阅读、充分理解本条款各细则，特别是其中所涉及的免除、限制深圳市克拉星球科技有限公司及科维特责任的条款、对用户权利限制条款、争议解决和法律适用等。请审慎阅读并选择接受或不接受本条款。除非用户接受本条款所有条款，否则用户无权使用科维特于本条款下所提供的服务。用户一经注册或使用本条款下任何服务即视为对本服务条款的充分理解和完全接受。用户违反本条款时，科维特有权依照其违反情况限制或停止向其提供服务，并有权追究相关责任。
		</view>
		<view class="title-content">
			本条款可由深圳市克拉星球科技有限公司随时更新，更新后的协议及规则条款一旦公布即代替原来的条款，恕不再另行通知。
			在深圳市克拉星球科技有限公司修改协议或规则条款后，
			如果用户不接受修改后的条款，请立即停止使用对应的服务，用户继续使用科维特接入服务将被视为已接受了修改后的条款。
		</view>
		<view class="title-label">
			定义
		</view>
		<view>
			如无特别说明，下列术语在本条款中的含义为：
		</view>
		<view>
			<view class="">
				• 1.2 用户，指使用用户接入科维特小程序的硬件设备使用者、软件应用使用者。
			</view>
			• 1.3 数据，指用户手动上传，或通过传感器等硬件设备自动上传的数据。
		</view>
		<view class="title-label">
			用户的权利和义务
		</view>
		<view class="title-label">
			2.1 注册认证
		</view>
		<view>
			1. 用户使用科维特小程序需要登录用户账号。通过申请获得账号的用户，务必妥善保管个人注册信息及登录密码等资料，
			对以其注册用户名进行的所有活动和时间负法律责任。如果用户因自身原因造成密码安全问题，由用户单方承担后果。通过注册获得账号的用户，务必保证注册信息真实、准确和完整，并在资料变更时及时更新相关信息。对于任何信息不实所导致用户及其用户或用户本人的损害，科维特不承担任何责任。
		</view>
		<view>
			2.
			一旦注册成为本站用户，即代表你保证：（a）你提交的个人信息是真实、准确、完整的；（b）你会不断更新个人资料，以符合及时、详尽、准确的要求；（c）你在使用服务时不会违反任何适用的国家法律或法规；（d）你在使用服务时不会违反本站一切有效的管理办法和规定。
		</view>
		<view class="">
			3.
			用户的个人资料受到本站的保护。用户注册成为本站用户后，您的用户信息将会在小程序上显示、共享。本站承诺不会在未获得用户许可的情况下擅自将用户的个人资料信息出租或出售给任何第三方，但以下情况除外：（a）用户同意让第三方共享资料；（b）用户同意公开其个人资料，享受相应的产品和服务；（c）本站需要听从法庭传票、法律命令或遵循法律程序；（d）本站发现用户违反了本站服务条款或本站其他使用规定。
		</view>
		<view class="title-label">
			2.2 接入产品所有权和使用权
		</view>
		<view class="title-content">
			用户在使用科维特小程序时，必须对其接入的硬件设备，或软件应用具备法律上的所有权或使用权。经审核若用户存在窃用第三方产品的，科维特将有权取消用户继续使用科维特小程序接入服务，终止本条款，并保留追究用户法律责任的权利。若造成用户本人或用户损害、纠纷的，科维特不承担任何责任。若造成科维特名誉及实质损害的，科维特有权要求用户及其用户恢复科维特名誉及顺势，并将保留追究用户法律责任的权利。
		</view>
		<view class="title-content">
			用户在使用科维特小程序服务时，必须符合中国大陆有关法律法规，使用信息服务不作非法用途和不道德行为，不干扰或混乱网络服务，并遵守所有使用服务的网络协议、规定、程序和惯例。若违反上述规定的，科维特有权要求用户所属产品用户予以处理，并保留追究用户法律责任的权利。若造成科维特名誉及实质损害的，科维特有权要求用户及其用户恢复科维特名誉及顺势，并将保留追究用户及用户法律责任的权利。
		</view>
		<view class="title-label">
			2.3 正确使用集成过程
		</view>
		<view class="title-content">
			用户使用科维特小程序前务必熟知开发流程，正确使用完成系统集成过程。若因个人操作不当，造成个人或第三方损害的，科维特不承担任何责任。若然造成科维特小程序名誉及实质损害的，科维特将保留追究用户法律责任的权利。用户务必合法使用科维特小程序授予其的服务，不得违反本条款宗旨用于其他目的，不得授予其他单位或个人使用。对用户因被他人冒用所致损失，科维特不承担任何责任，并且用户必须就其一切活动承担全部责任。如因以上过失，对科维特小程序造成名誉或实质损害的，科维特将保留追究用户法律责任的权利。
		</view>
		<view class="title-label">
			2.4 基本原则
		</view>
		<view class="title-content">
			用户将第三方应用接入科维特小程序，科维特不涉足其业务、功能逻辑的实现，和数据、内容审核义务。用户需要对接入的第三方应用承担一切的责任，必须保证以下基本原则：
		</view>
		<view class="">
			• （1）不得上传、发布、传播、存储违反宪法、国家法律法规禁止的，危害国家安全、泄露国家秘密、颠覆国家政权、破坏国家统一的，煽动民族仇恨、破坏民族团结的，宣扬邪教封建迷信、迫害宗教政策的，扰乱社会秩序、破坏社会未定的内容。
			<view class="">
				• （2）不得在设备查看等页面宣传与其产品无关的任何其他信息，如广告、非法信息宣传等。也不得发布涉及他人隐私，侵犯他人名誉权、肖像权、商业秘密、知识产权等内容。
			</view>

			•
			（3）未经科维特书面许可，用户不得模仿和使用科维特或科维特小程序任何商业标识或近似的产品标识。也不得公开表达或暗示，用户与科维特存在合作关系，包括但不限于相互持股、商业往来或其他合作关系等，或声称科维特对用户的认可。对于有意无意造成用户混淆的行为，科维特有权要求用户修改，暂停或终止服务，并保留追究其法律责任的权利。
			<view class="">
				•
				（4）用户拥有依照本条款约定合法使用科维特小程序开放API的权利，但不得向任何单位或个人出售转让或转授权科维特小程序的代码、API及开发工具等。也不得通过包括但不限于赠送、发售等方式使用和科维特有直接竞争关系的公司的产品或品牌服务等，如因用户违反此条款给用户或科维特造成任何损失的，用户应当赔偿损失，并承担相应的法律责任。
			</view>
			• （5）用户同意接收来自科维特发出的邮件、信息，包括但不限于关于用户利益、商业推广的信息等；用户如需向科维特进行通知，应当通过科维特对外正式公布的通信地址、电子邮件地址等联系信息送达。
			<view class="">
				• （6）用户应对其产品的设计、开发、测试、维护、生产等工序负责，并承担应有的成本。如需科维特提供有偿服务，需向科维特对外正式公布的需求受理渠道或人员提交详细的需求文档，依照双方额外签订的协议执行。
			</view>
		</view>
		<view class="title-label">
			科维特的权利和义务
		</view>
		<view class="">
			• 3.1 科维特对接入或即将接入科维特小程序的用户提供详尽的系统解说义务。包括但不限于系统的功能与使用，系统免费与付费模块等。同时为用户提供有效及时的咨询服务和可行的技术支持。

			<view class="">
				• 3.2 科维特有权审查用户是否具备合法的接入科维特小程序的资格，上传的数据是否合法。
			</view>
			• 3.3 深圳市克拉星球科技有限公司拥有合作过程中涉及到的科维特小程序的所有服务内容知识产权，以及品牌、知识产权在合作过程中所产生的衍生品的全部合法权益。
			<view class="">
				• 3.4
				用户因违反相关法律法规而被取缔运营，或因违规操作被监管部门查封所引发的全部责任，由用户独立承担。情节严重并给科维特带来不利影响的，用户须赔偿科维特所有损失，并恢复科维特小程序声誉，此情况下科维特有权单方终止本条款。
			</view>
			• 3.5
			如发现用户有违法行为，或其上传的用户数据中包含违法信息或可能侵犯他人合法权益的信息，无论是否已造成不良后果，科维特均有权要求用户立即停止违法行为或更换、修改违法内容，或者单方终止本服务协议，并且有权要求用户赔偿由此给科维特造成的损失。
			<view class="">
				• 3.6 如发生下列任一情形，科维特有权以普通或非专业人员的知识水平标准对相关内容进行判别，如认为这些内容或行为具有不合理或违法的情形，科维特有权删除相关信息，或终止或暂停对该用户提供服务。
			</view>
		</view>
		<view class="title-content">
			• （1）其他第三方对某个用户或具体事项持有异议并书面通知科维特；
			<view class="">
				• （2）其他第三方书面告知科维特小程序上有违法或不当情形的。
			</view>
		</view>
		<view class="">
			• 3.7 科维特可将本条款下的权利和义务的部分或全部转让给他人，如果用户不同意科维特的该转让，则有权停止使用本条款下服务。如果用户和小程序用户继续使用，则视为用户和小程序用户对此转让予以接受。
			<view class="">
				• 3.8 用户违反小程序使用规则时，科维特有权依照科维特小程序的认识判断决定并采取终止与用户的服务协议关系，及其他认为适合的处理方式等行动。
			</view>
			• 3.9 科维特可通过网页公告、电子邮件、手机短信或常规的信件传送等方式向用户发出通知，该等通知在送达时即视为已送达收件人

		</view>
		<view class="title-label">
			知识产权条款
		</view>
		<view class="">
			• 4.1 科维特小程序上所有内容，均由其权利人依法拥有知识产权，包括但不限于商标权、专利权、著作权、商业秘密等。非经其权利人书面同意，任何人不得擅自使用、修改、复制、公开传播、改变、散布、发行或公开发表科维特小程序上的内容。
			<view class="">
				• 4.2 用户应在其服务中向相关权利人提供知识产权投诉途径，确保权利人可以向用户主张权利。
			</view>

		</view>
		<view class="title-label">
			隐私相关条款
		</view>
		<view class="title-content">
			科维特重视对用户及小程序用户隐私的保护，保护隐私是科维特的一项基本政策。
			如发生下列任一情况，科维特有权对用户的信息予以披露：
		</view>
		<view class="">
			• （1）经用户本人同意披露的；
			<view class="">
				• （2）根据法律的有关规定，应相关第三人、行政机构或司法机构的要求，需要向其披露的；
			</view>
			• （3）用户出现违反中国有关法律、法规、规章、政策的情形，需要向他人披露的；
			<view class="">
				• （4）科维特基于为用户和小程序用户服务的目的而认为合适披露的其他情形；
			</view>

		</view>
		<view class="title-label">
			服务暂停或终止
		</view>
		<view class="">
			• 6.1 用户应确保自身在注册时填写的姓名（名称）、地址、电子邮箱等相关资料真实、准确，如科维特发现其不真实或不准确的，科维特有权暂停或终止向其提供本条款下服务,由此产生的一切法律责任由用户自行承担。
			<view class="">
				• 6.2 如用户书面通知科维特不接受经深圳市克拉星球科技有限公司修改的新的服务协议的，深圳市克拉星球科技有限公司有权随时暂停或终止向其提供本条款下服务。
			</view>
			• 6.3 本条款约定的其他协议终止条件发生或实现的，科维特有权随时暂停或终止向用户提供本条款下服务。
			<view class="">
				• 6.4 在用户违反本条款规定时，科维特有权随时暂停或终止向该用户提供部分或全部小程序服务。如该用户后续再直接或间接或以他人名义注册并登录科维特小程序的，科维特有权直接单方面暂停或终止提供本条款下服务。
			</view>
			• 6.5 在合作期限内，因不可抗力因素导致授权程序无法继续运营的，双方可协商终止协议。
			<view class="">
				• 6.6 如本条款服务终止，科维特有权保留或删除用户账号中的任何信息，且有权拒绝将该信息发还给用户，也有权保存或删除用户的全部相关数据，包括服务终止前用户尚未完成的任何数据。
			</view>
			• 6.7
			在用户存在违反法律法规或国家相关政策规定时，科维特有权随时暂停或终止向该用户提供部分或全部小程序服务。如该用户后续再直接或间接（如以他人名义）注册并登录科维特小程序的，科维特有权直接单方面暂停或终止提供本条款下服务。

		</view>
		<view class="title-label">
			协议内容修改
		</view>
		<view class="">
			• 7.1 本条款内容包括协议正文及所有科维特已经发布的或将来可能发布的科维特小程序相关规则。上述规则为本条款不可分割的一部分，与本条款正文具有同等法律效力。
			<view class="">
				• 7.2
				科维特有权根据需要不时地制订、修改本条款或各类规则，且毋须另行通知。其一旦发生变动，科维特将会在相关页面上公布修改后的协议或规则，如果用户不同意所改动的内容，应主动取消服务，如果继续使用服务，则视为接受协议或规则的变动。除另行明确声明外，任何使“服务”范围扩大或功能增强的新内容均受本条款约束。
			</view>
		</view>
		<view class="title-label">
			免责事由
		</view>
		<view class="">
			• 8.1 鉴于小程序服务的特殊性，科维特有权变更、中断部分或全部的服务，并按本条款规定删除用户在使用“服务”中提交的任何资料，而无需通知用户，也无需承担任何责任。
			<view class="">
				• 8.2 科维特有权定期或不定期地对提供服务的小程序或相关的设备进行检修或者维护，如因此类情况而造成小程序服务在一定时间内的中断或暂停，科维特无需为此承担任何责任。
			</view>
			• 8.3 如发生下述任一情况而导致服务中断及用户损失的，科维特不承担责任：

		</view>
		<view class="title-content">
			<view class="">
				• （1）发生不可抗力情形的；
			</view>
			<view class="">
				• （2）黑客攻击、计算机病毒侵入或发作的；
			</view>
			<view class="">
				• （3）计算机系统遭到破坏、瘫痪或无法正常使用的；
			</view>
			<view class="">
				• （4）电信部门技术调整的；
			</view>
			<view class="">
				• （5）因政府管制而造成暂时性关闭的；
			</view>
			<view class="">
				• （6）其它非因科维特的过错而引起的。
			</view>
		</view>
		<view class="title-label">
			本条款的解释、法律适用及争端解决
		</view>
		<view class="">
			<view class="">
				• 9.1 深圳市克拉星球科技有限公司对本条款条款拥有最终解释权。
			</view>
			<view class="">
				• 9.2 本条款的有效性、履行和与本条款及其修订本效力有关的所有事宜，将受中华人民共和国大陆法律管辖，任何争议仅适用中华人民共和国大陆法律。
			</view>
		</view>
	</view>
</template>

<script>
	export default {
		data() {
			return {
				
			};
		},
		onLoad(option) {
		
		},
		methods: {

		}
	}
</script>

<style scoped>
	.title {
		font-size: 15px;
		font-weight: bold;
		text-align: center;
	}

	.title-label {
		font-size: 15px;
		font-weight: bold;
	}

	.title-content {
		text-indent: 2em;
	}
</style>
